# ControlStructures

Задание 1. Приложение по определению чётного или нечётного числа

Что нужно сделать

Напишите приложение, которое определяет чётное или нечётное число. Алгоритм приложения выглядит следующим образом:
На экране программа с помощью оператора Console.WriteLine предлагает пользователю ввести целое число.
С помощью оператора Console.ReadLine считывается введённое число.
С помощью метода int.Parse число преобразуется в целочисленную переменную.
С помощью оператора деления с остатком определяется, чётное число или нечётное.
В зависимости от предыдущего шага на экран выводится текст, является ли данное число чётным или нет.


Задание 2. Программа подсчёта суммы карт в игре «21»

Что нужно сделать

Есть довольно простая карточная игра, она называется «21». Суть игры сводится к подсчёту карт. Каждая карта имеет свой «вес». Напишите программу, которая подсчитает сумму всех карт у вас на руках. Задача программы сводится к следующему алгоритму:

Программа приветствует пользователя и спрашивает, сколько у него на руках карт.
Пользователь вводит целое число.
Преобразуем это число в счётчик для цикла.
С помощью цикла for итеративно просим пользователя ввести номинал каждой карты. Для карт с числовым номиналом он вводит только цифру. 
Для «картинок» следует принять обозначения латинскими буквами:
Валет = J
Дама = Q
Король = K
Туз = T
Внутри цикла, используя оператор switch, «вес» каждой карты складываем в общую переменную суммы, которая объявлена до тела основного цикла.
Для числовых карт их «вес» равен весу, указанному при вводе пользователем. Для «картинок» «вес» равен 10.
По завершении ввода на экране появится значение суммы карт.


Задание 3. Проверка простого числа

Что нужно сделать

Эта задача — одна из самых распространённых и популярных. Простое число — число, которое делится само на себя и на единицу. Есть много алгоритмов поиска простых чисел. Реализуйте один из самых лёгких. Проверьте введённое с клавиатуры целое число на признак простоты. Чтобы закрепить знания, реализуйте эту задачу, используя цикл while.

Для начала пользователь вводит целое число.
Затем в цикле нужно перебрать все числа, начиная с 1 и до N − 1.
Входное число N при каждой итерации цикла нужно делить на число, которое получается в цикле с остатком.
Если остаток от деления равен 0, значит, программа нашла делитель этого числа, и потому это число уже не может являться простым числом.
Если остаток от деления равен 0, то переменной bool, объявленной за рамками цикла, следует присвоить значение true.
Если после выхода из цикла значение переменной осталось false, значит, число простое. Если значение переменной стало true, значит, был найден делитель, поэтому число не может считаться простым.


Задание 4. Наименьший элемент в последовательности

Что нужно сделать

Найдите наименьший элемент в последовательности, которую вводит пользователь. Детальный алгоритм программы:

Пользователь вводит длину последовательности. 
Затем пользователь последовательно вводит целые числа (как положительные, так и отрицательные). Числа разделяются клавишей Enter.
Каждое введённое число сравнивается со значением переменной, отвечающей за минимальный элемент. Если введённое число оказывается меньше, то нужно обновить значение переменной.


Задание 5. Игра «Угадай число»

Что нужно сделать

Разработайте программу по следующему алгоритму:

Пользователь вводит максимальное целое число диапазона.
На основе диапазона целых чисел (от 0 до «введено пользователем») программа генерирует случайное целое число из диапазона. 
Пользователю предлагается ввести загаданное программой случайное число. Пользователь вводит свои предположения в консоли приложения. 
Если число меньше загаданного, программа сообщает об этом пользователю. 
Если больше, то тоже сообщает, что число больше загаданного.
Программа завершается, когда пользователь угадывает число. 
Если пользователь устал играть, то вместо ввода числа он вводит пустую строку и нажимает Enter. Тогда программа завершается, предварительно показывая, какое число было загадано.

